espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>APP_SPI3_DMA_INT_MAP</name>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_SPI3_DMA_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_WDG_INT_MAP</name>
          <addressOffset>0x2F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_WDG_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TIMER_INT1_MAP</name>
          <addressOffset>0x2F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TIMER_INT1_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TIMER_INT2_MAP</name>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TIMER_INT2_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG_T0_EDGE_INT_MAP</name>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG_T0_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG_T1_EDGE_INT_MAP</name>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG_T1_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG_WDT_EDGE_INT_MAP</name>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG_WDT_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG_LACT_EDGE_INT_MAP</name>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG_LACT_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG1_T0_EDGE_INT_MAP</name>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG1_T0_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG1_T1_EDGE_INT_MAP</name>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG1_T1_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG1_WDT_EDGE_INT_MAP</name>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG1_WDT_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_TG1_LACT_EDGE_INT_MAP</name>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_TG1_LACT_EDGE_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_MMU_IA_INT_MAP</name>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_MMU_IA_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_MPU_IA_INT_MAP</name>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_MPU_IA_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CACHE_IA_INT_MAP</name>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>APP_CACHE_IA_INT_MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_UART</name>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UART_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SPI1</name>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SPI0</name>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI0_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_GPIO</name>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_FE2</name>
          <addressOffset>0x33C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FE2_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_FE</name>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FE_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_TIMER</name>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_RTC</name>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_IO_MUX</name>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IOMUX_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_WDG</name>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WDG_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_HINF</name>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HINF_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_UHCI1</name>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UHCI1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_MISC</name>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MISC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_I2C</name>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_I2S0</name>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2S0_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_UART1</name>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UART1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_BT</name>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BT_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_BT_BUFFER</name>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BTBUFFER_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_I2C_EXT0</name>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2CEXT0_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_UHCI0</name>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UHCI0_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SLCHOST</name>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLCHOST_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_RMT</name>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RMT_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_PCNT</name>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCNT_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SLC</name>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_LEDC</name>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LEDC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_EFUSE</name>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EFUSE_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SPI_ENCRYPT</name>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI_ENCRYPY_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_BB</name>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BB_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_PWM0</name>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWM0_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_TIMERGROUP</name>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMERGROUP_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_TIMERGROUP1</name>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMERGROUP1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SPI2</name>
          <addressOffset>0x3A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI2_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SPI3</name>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI3_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_APB_CTRL</name>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APBCTRL_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_I2C_EXT1</name>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2CEXT1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_SDIO_HOST</name>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDIOHOST_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_EMAC</name>
          <addressOffset>0x3BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EMAC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_CAN</name>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAN_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_PWM1</name>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWM1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_I2S1</name>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2S1_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_UART2</name>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UART2_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
