espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>AHBLITE_MPU_TABLE_PWM2</name>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWM2_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_PWM3</name>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWM3_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_RWBT</name>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RWBT_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_BTMAC</name>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BTMAC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_WIFIMAC</name>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIFIMAC_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBLITE_MPU_TABLE_PWR</name>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWR_ACCESS_GRANT_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_ACCESS_DBUG0</name>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_ROM_MPU_AD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_ROM_IA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_ROM_MPU_AD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_ROM_IA</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHARE_ROM_MPU_AD</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHARE_ROM_IA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_MMU_AD</name>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_IA</name>
              <bitOffset>14</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERNAL_SRAM_MMU_MULTI_HIT</name>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_ACCESS_DBUG1</name>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_SRAM_MMU_MISS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARB_IA</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIDGEN_IA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_ACCESS_DENY</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBLITE_ACCESS_DENY</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBLITE_IA</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG0</name>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_SLAVE_WDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_MMU_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_CACHE_IA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_CACHE_STATE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_WR_BAK_TO_READ</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_TX_END</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_SLAVE_WR</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_SLAVE_WDATA_V</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_RX_END</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG1</name>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CTAG_RAM_RDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG2</name>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_VADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG3</name>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_MMU_RDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA</name>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_OPPOSITE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_DRAM1</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_IROM0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_IRAM1</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_IRAM0</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_DISABLED_CACHE_IA_DROM0</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_IRAM0_PID_ERROR</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG4</name>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DRAM1ADDR0_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG5</name>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DROM0ADDR0_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG6</name>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IRAM0ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG7</name>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IRAM1ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG8</name>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IROM0ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_DBUG9</name>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_OPSDRAMADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG0</name>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_SLAVE_WDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CACHE_MMU_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CACHE_IA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CACHE_STATE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_WR_BAK_TO_READ</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_TX_END</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_SLAVE_WR</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_SLAVE_WDATA_V</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_RX_END</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG1</name>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_CTAG_RAM_RDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG2</name>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_CACHE_VADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG3</name>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_MMU_RDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA</name>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_OPPOSITE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_DRAM1</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_IROM0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_IRAM1</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_IRAM0</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_DISABLED_CACHE_IA_DROM0</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CACHE_IRAM0_PID_ERROR</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG4</name>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_DRAM1ADDR0_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG5</name>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_DROM0ADDR0_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG6</name>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_IRAM0ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG7</name>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_IRAM1ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG8</name>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_IROM0ADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_DCACHE_DBUG9</name>
          <addressOffset>0x43C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_OPSDRAMADDR_IA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_CTRL</name>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_RECORD_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_RECORD_DISABLE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CPU_PDEBUG_ENABLE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_STATUS</name>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CPU_RECORDING</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PID</name>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGINST</name>
          <addressOffset>0x44C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGINST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECORD_PDEBUGINST_SZ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGINST_ISRC</name>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGINST_LOOP_REP</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGINST_LOOP</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGINST_CINTL</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
