espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>PRO_CPU_RECORD_PDEBUGSTATUS</name>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGSTATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECORD_PDEBUGSTATUS_BBCAUSE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGSTATUS_INSNTYPE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGDATA</name>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP_OTHER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_EXCVEC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_SR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_RER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_BUFF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_WER</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_BUFFCONFL</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_ER</name>
              <bitOffset>2</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_DCM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_LSU</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_ICM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_IRAMBUSY</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP_LSU</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_IPIF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_RSR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_TIE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_WSR</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_RUN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_INSNTYPE_XSR</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP_STR</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_BPIFETCH</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_L32R</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_LSPROC</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_BPLOAD</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP_MEMW</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_EXCCAUSE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_BANKCONFL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_DEP_HALT</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_ITERMUL</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGDATA_STALL_ITERDIV</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGPC</name>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGPC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGLS0STAT</name>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGLS0STAT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_TYPE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_SZ</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_DTLBM</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_DCM</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_DCH</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_UC</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_WB</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_COH</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_STCOH</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECORD_PDEBUGLS0STAT_TGT</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGLS0ADDR</name>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGLS0ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_RECORD_PDEBUGLS0DATA</name>
          <addressOffset>0x464</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_PRO_PDEBUGLS0DATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_CTRL</name>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>APP_CPU_RECORD_ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_RECORD_DISABLE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CPU_PDEBUG_ENABLE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_STATUS</name>
          <addressOffset>0x46C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_CPU_RECORDING</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PID</name>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGINST</name>
          <addressOffset>0x474</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGINST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGSTATUS</name>
          <addressOffset>0x478</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGSTATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGDATA</name>
          <addressOffset>0x47C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGDATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGPC</name>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGPC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGLS0STAT</name>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGLS0STAT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGLS0ADDR</name>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGLS0ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CPU_RECORD_PDEBUGLS0DATA</name>
          <addressOffset>0x48C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECORD_APP_PDEBUGLS0DATA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_PD_CTRL</name>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSA_PD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MPU_TABLE0</name>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ROM_MPU_TABLE0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MPU_TABLE1</name>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ROM_MPU_TABLE1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MPU_TABLE2</name>
          <addressOffset>0x49C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ROM_MPU_TABLE2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MPU_TABLE3</name>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ROM_MPU_TABLE3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE0</name>
          <addressOffset>0x4A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE1</name>
          <addressOffset>0x4A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE2</name>
          <addressOffset>0x4AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE3</name>
          <addressOffset>0x4B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE4</name>
          <addressOffset>0x4B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE5</name>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE6</name>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE6</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE7</name>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE7</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE8</name>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE9</name>
          <addressOffset>0x4C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE9</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE10</name>
          <addressOffset>0x4CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE10</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHROM_MPU_TABLE11</name>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SHROM_MPU_TABLE11</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
