espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>CACHE_IA_INT_EN</name>
          <addressOffset>0x5A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_IA_INT_EN</name>
              <description>Interrupt enable bits for various invalid cache access reasons</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_DROM0</name>
              <description>APP CPU invalid access to DROM0 when cache is disabled </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_IRAM0</name>
              <description>APP CPU invalid access to IRAM0 when cache is disabled </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_IRAM1</name>
              <description>APP CPU invalid access to IRAM1 when cache is disabled </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_IROM0</name>
              <description>APP CPU invalid access to IROM0 when cache is disabled </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_DRAM1</name>
              <description>APP CPU invalid access to DRAM1 when cache is disabled </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_APP_OPPOSITE</name>
              <description>APP CPU invalid access to APP CPU cache when cache disabled </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_DROM0</name>
              <description>PRO CPU invalid access to DROM0 when cache is disabled </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_IRAM0</name>
              <description>PRO CPU invalid access to IRAM0 when cache is disabled </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_IRAM1</name>
              <description>PRO CPU invalid access to IRAM1 when cache is disabled </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_IROM0</name>
              <description>PRO CPU invalid access to IROM0 when cache is disabled </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_DRAM1</name>
              <description>PRO CPU invalid access to DRAM1 when cache is disabled </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_IA_INT_PRO_OPPOSITE</name>
              <description>PRO CPU invalid access to APP CPU cache when cache disabled </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURE_BOOT_CTRL</name>
          <addressOffset>0x5A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SW_BOOTLOADER_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DMA_CHAN_SEL</name>
          <addressOffset>0x5A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI1_DMA_CHAN_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_DMA_CHAN_SEL</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_DMA_CHAN_SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_VECBASE_CTRL</name>
          <addressOffset>0x5AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_OUT_VECBASE_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_VECBASE_SET</name>
          <addressOffset>0x5B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_OUT_VECBASE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_VECBASE_CTRL</name>
          <addressOffset>0x5B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_OUT_VECBASE_SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_VECBASE_SET</name>
          <addressOffset>0x5B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APP_OUT_VECBASE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01605190</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
