espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>cali_data</name>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALI_VALUE_SYNC2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CALI_RDY_REAL</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CALI_RDY_SYNC2</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-255</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_SEL</name>
              <description>select one of the 256 inputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_INV_SEL</name>
              <description>revert the value of the input if you want to revert  please set the value to 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL</name>
              <description>if the slow signal bypass the io matrix or not if you want  setting the value to 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>40</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-39</dimIndex>
          <name>FUNC%s_OUT_SEL_CFG</name>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_SEL</name>
              <description>select one of the 256 output to 40 GPIO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_SEL</name>
              <description>invert the output value  if you want to revert the output value  setting the value to 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_SEL</name>
              <description>weather using the logical oen signal or not using the value setting by the register</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_INV_SEL</name>
              <description>invert the output enable value  if you want to revert the output enable value  setting the value to 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_SD</name>
      <description>Sigma-Delta Modulation</description>
      <groupName>GPIO_SIGMADELTA</groupName>
      <baseAddress>0x3FF44F00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SIGMADELTA0</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD0_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD0_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD1_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA2</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD2_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA3</name>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD3_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD3_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA4</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD4_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD4_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA5</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD5_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD5_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA6</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD6_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD6_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA7</name>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>SD7_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD7_PRESCALE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CG</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SD_CLK_EN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI_SWAP</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x01506190</resetValue>
          <fields>
            <field>
              <name>SD_DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
