espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>INT_RAW</name>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTIMER0_OVF_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel0  counter overflow.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER1_OVF_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel1  counter overflow.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER2_OVF_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel2  counter overflow.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER3_OVF_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel3  counter overflow.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER0_OVF_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel0  counter overflow.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel1  counter overflow.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel2  counter overflow.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel3  counter overflow.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH0_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 0 duty change done.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH1_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 1 duty change done.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH2_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 2 duty change done.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH3_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 3 duty change done.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH4_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 4 duty change done.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH5_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 5 duty change done.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH6_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 6 duty change done.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH7_INT_RAW</name>
              <description>The interrupt raw bit for high speed channel 7 duty change done.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 0 duty change done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 1 duty change done.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 2 duty change done.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 3 duty change done.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 4 duty change done.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 5 duty change done.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH6_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 6 duty change done.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH7_INT_RAW</name>
              <description>The interrupt raw bit for low speed channel 7 duty change done.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTIMER0_OVF_INT_ST</name>
              <description>The interrupt status bit for high speed channel0  counter overflow event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER1_OVF_INT_ST</name>
              <description>The interrupt status bit for high speed channel1  counter overflow event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER2_OVF_INT_ST</name>
              <description>The interrupt status bit for high speed channel2  counter overflow event.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSTIMER3_OVF_INT_ST</name>
              <description>The interrupt status bit for high speed channel3  counter overflow event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER0_OVF_INT_ST</name>
              <description>The interrupt status bit for low speed channel0  counter overflow event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ST</name>
              <description>The interrupt status bit for low speed channel1  counter overflow event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ST</name>
              <description>The interrupt status bit for low speed channel2  counter overflow event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ST</name>
              <description>The interrupt status bit for low speed channel3  counter overflow event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH0_INT_ST</name>
              <description>The interrupt status bit for high speed channel 0 duty change done event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH1_INT_ST</name>
              <description>The interrupt status bit for high speed channel 1 duty change done event.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH2_INT_ST</name>
              <description>The interrupt status bit for high speed channel 2 duty change done event.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH3_INT_ST</name>
              <description>The interrupt status bit for high speed channel 3 duty change done event.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH4_INT_ST</name>
              <description>The interrupt status bit for high speed channel 4 duty change done event.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH5_INT_ST</name>
              <description>The interrupt status bit for high speed channel 5 duty change done event.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH6_INT_ST</name>
              <description>The interrupt status bit for high speed channel 6 duty change done event.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH7_INT_ST</name>
              <description>The interrupt status bit for high speed channel 7 duty change done event.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ST</name>
              <description>The interrupt status bit for low speed channel 0 duty change done event.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ST</name>
              <description>The interrupt status bit for low speed channel 1 duty change done event.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ST</name>
              <description>The interrupt status bit for low speed channel 2 duty change done event.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ST</name>
              <description>The interrupt status bit for low speed channel 3 duty change done event.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ST</name>
              <description>The interrupt status bit for low speed channel 4 duty change done event.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ST</name>
              <description>The interrupt status bit for low speed channel 5 duty change done event.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH6_INT_ST</name>
              <description>The interrupt status bit for low speed channel 6 duty change done event.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH7_INT_ST</name>
              <description>The interrupt status bit for low speed channel 7 duty change done event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTIMER0_OVF_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel0  counter overflow interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTIMER1_OVF_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel1  counter overflow interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTIMER2_OVF_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel2  counter overflow interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTIMER3_OVF_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel3  counter overflow interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER0_OVF_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel0  counter overflow interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel1  counter overflow interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel2  counter overflow interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel3  counter overflow interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH0_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 0 duty change done interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH1_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 1 duty change done interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH2_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 2 duty change done interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH3_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 3 duty change done interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH4_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 4 duty change done interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH5_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 5 duty change done interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH6_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 6 duty change done interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH7_INT_ENA</name>
              <description>The interrupt enable bit for high speed channel 7 duty change done interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 0 duty change done interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 1 duty change done interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 2 duty change done interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 3 duty change done interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 4 duty change done interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 5 duty change done interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH6_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 6 duty change done interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH7_INT_ENA</name>
              <description>The interrupt enable bit for low speed channel 7 duty change done interrupt.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
