espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>INT_CLR</name>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTIMER0_OVF_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel0  counter overflow interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSTIMER1_OVF_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel1  counter overflow interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSTIMER2_OVF_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel2  counter overflow interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSTIMER3_OVF_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel3  counter overflow interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER0_OVF_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel0  counter overflow interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel1  counter overflow interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel2  counter overflow interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel3  counter overflow interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH0_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 0 duty change done interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH1_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 1 duty change done interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH2_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 2 duty change done interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH3_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 3 duty change done interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH4_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 4 duty change done interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH5_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 5 duty change done interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH6_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 6 duty change done interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_HSCH7_INT_CLR</name>
              <description>Set this  bit to clear  high speed channel 7 duty change done interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 0 duty change done interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 1 duty change done interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 2 duty change done interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 3 duty change done interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 4 duty change done interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 5 duty change done interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH6_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 6 duty change done interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH7_INT_CLR</name>
              <description>Set this  bit to clear  low speed channel 7 duty change done interrupt.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_CLK_SEL</name>
              <description>This bit is used to set the frequency of slow_clk. 1'b1:80mhz  1'b0:8mhz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x16031700</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>This register represents the version .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
