espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PWM0">
      <name>PWM1</name>
      <description>Motor Control Pulse-Width Modulation</description>
      <baseAddress>0x3FF6C000</baseAddress>
      <interrupt>
        <name>PWM1</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>NRX</name>
      <description>Peripheral NRX</description>
      <groupName>NRX</groupName>
      <baseAddress>0x3FF5CC00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NRXPD_CTRL</name>
          <description>WiFi RX control register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEMAP_FORCE_PD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMAP_FORCE_PU</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIT_FORCE_PD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIT_FORCE_PU</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ROT_FORCE_PD</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ROT_FORCE_PU</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAN_EST_FORCE_PD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAN_EST_FORCE_PU</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCNT</name>
      <description>Pulse Count Controller</description>
      <groupName>PCNT</groupName>
      <baseAddress>0x3FF57000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PCNT</name>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>U0_CONF0</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U0</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U0</name>
              <description>This is the enable bit for filtering input signals for unit0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U0</name>
              <description>This is the enable bit for comparing unit0's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U0</name>
              <description>This is the enable bit for  comparing unit0's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U0</name>
              <description>This is the enable bit for comparing unit0's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U0</name>
              <description>This is the enable bit for comparing unit0's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U0</name>
              <description>This is the enable bit for  comparing  unit0's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U0</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit0. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U0</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit0. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U0</name>
              <description>This register is used to control the mode of channel0's high control signal for unit0. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U0</name>
              <description>This register is used to control the mode of channel0's low control signal for unit0. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U0</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit0. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U0</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit0. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U0</name>
              <description>This register is used to control the mode of channel1's high control signal for unit0. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U0</name>
              <description>This register is used to control the mode of channel1's low control signal for unit0. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U0_CONF1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U0</name>
              <description>This register is used to configure thres0 value for unit0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U0</name>
              <description>This register is used to configure  thres1 value for unit0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U0_CONF2</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U0</name>
              <description>This register is used to configure thr_h_lim value for unit0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U0</name>
              <description>This register is used to confiugre thr_l_lim value for unit0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U1_CONF0</name>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U1</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U1</name>
              <description>This is the enable bit for filtering input signals for unit1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U1</name>
              <description>This is the enable bit for comparing unit1's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U1</name>
              <description>This is the enable bit for  comparing unit1's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U1</name>
              <description>This is the enable bit for comparing unit1's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U1</name>
              <description>This is the enable bit for comparing unit1's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U1</name>
              <description>This is the enable bit for  comparing  unit1's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U1</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit1. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U1</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit1. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U1</name>
              <description>This register is used to control the mode of channel0's high control signal for unit1. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U1</name>
              <description>This register is used to control the mode of channel0's low control signal for unit1. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U1</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit1. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U1</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit1. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U1</name>
              <description>This register is used to control the mode of channel1's high control signal for unit1. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U1</name>
              <description>This register is used to control the mode of channel1's low control signal for unit1. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U1_CONF1</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U1</name>
              <description>This register is used to configure thres0 value for unit1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U1</name>
              <description>This register is used to configure  thres1 value for unit1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U1_CONF2</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U1</name>
              <description>This register is used to configure thr_h_lim value for unit1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U1</name>
              <description>This register is used to confiugre thr_l_lim value for unit1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
