espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>U2_CONF0</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U2</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U2</name>
              <description>This is the enable bit for filtering input signals for unit2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U2</name>
              <description>This is the enable bit for comparing unit2's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U2</name>
              <description>This is the enable bit for  comparing unit2's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U2</name>
              <description>This is the enable bit for comparing unit2's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U2</name>
              <description>This is the enable bit for comparing unit2's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U2</name>
              <description>This is the enable bit for  comparing  unit2's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U2</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit2. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U2</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit2. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U2</name>
              <description>This register is used to control the mode of channel0's high control signal for unit2. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U2</name>
              <description>This register is used to control the mode of channel0's low control signal for unit2. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U2</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit2. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U2</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit2. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U2</name>
              <description>This register is used to control the mode of channel1's high control signal for unit2. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U2</name>
              <description>This register is used to control the mode of channel1's low control signal for unit2. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U2_CONF1</name>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U2</name>
              <description>This register is used to configure thres0 value for unit2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U2</name>
              <description>This register is used to configure  thres1 value for unit2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U2_CONF2</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U2</name>
              <description>This register is used to configure thr_h_lim value for unit2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U2</name>
              <description>This register is used to confiugre thr_l_lim value for unit2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U3_CONF0</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U3</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U3</name>
              <description>This is the enable bit for filtering input signals for unit3.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U3</name>
              <description>This is the enable bit for comparing unit3's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U3</name>
              <description>This is the enable bit for  comparing unit3's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U3</name>
              <description>This is the enable bit for comparing unit3's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U3</name>
              <description>This is the enable bit for comparing unit3's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U3</name>
              <description>This is the enable bit for  comparing  unit3's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U3</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit3. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U3</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit3. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U3</name>
              <description>This register is used to control the mode of channel0's high control signal for unit3. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U3</name>
              <description>This register is used to control the mode of channel0's low control signal for unit3. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U3</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit3. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U3</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit3. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U3</name>
              <description>This register is used to control the mode of channel1's high control signal for unit3. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U3</name>
              <description>This register is used to control the mode of channel1's low control signal for unit3. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U3_CONF1</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U3</name>
              <description>This register is used to configure thres0 value for unit3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U3</name>
              <description>This register is used to configure  thres1 value for unit3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U3_CONF2</name>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U3</name>
              <description>This register is used to configure thr_h_lim value for unit3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U3</name>
              <description>This register is used to confiugre thr_l_lim value for unit3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U4_CONF0</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U4</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U4</name>
              <description>This is the enable bit for filtering input signals for unit4.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U4</name>
              <description>This is the enable bit for comparing unit4's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U4</name>
              <description>This is the enable bit for  comparing unit4's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U4</name>
              <description>This is the enable bit for comparing unit4's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U4</name>
              <description>This is the enable bit for comparing unit4's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U4</name>
              <description>This is the enable bit for  comparing  unit4's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U4</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit4. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U4</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit4. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U4</name>
              <description>This register is used to control the mode of channel0's high control signal for unit4. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U4</name>
              <description>This register is used to control the mode of channel0's low control signal for unit4. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U4</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit4. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U4</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit4. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U4</name>
              <description>This register is used to control the mode of channel1's high control signal for unit4. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U4</name>
              <description>This register is used to control the mode of channel1's low control signal for unit4. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U4_CONF1</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U4</name>
              <description>This register is used to configure thres0 value for unit4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U4</name>
              <description>This register is used to configure  thres1 value for unit4.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U4_CONF2</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U4</name>
              <description>This register is used to configure thr_h_lim value for unit4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U4</name>
              <description>This register is used to confiugre thr_l_lim value for unit4.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
