espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>U5_CONF0</name>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U5</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U5</name>
              <description>This is the enable bit for filtering input signals for unit5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U5</name>
              <description>This is the enable bit for comparing unit5's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U5</name>
              <description>This is the enable bit for  comparing unit5's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U5</name>
              <description>This is the enable bit for comparing unit5's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U5</name>
              <description>This is the enable bit for comparing unit5's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U5</name>
              <description>This is the enable bit for  comparing  unit5's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U5</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit5. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U5</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit5. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U5</name>
              <description>This register is used to control the mode of channel0's high control signal for unit5. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U5</name>
              <description>This register is used to control the mode of channel0's low control signal for unit5. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U5</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit5. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U5</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit5. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U5</name>
              <description>This register is used to control the mode of channel1's high control signal for unit5. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U5</name>
              <description>This register is used to control the mode of channel1's low control signal for unit5. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U5_CONF1</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U5</name>
              <description>This register is used to configure thres0 value for unit5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U5</name>
              <description>This register is used to configure  thres1 value for unit5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U5_CONF2</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U5</name>
              <description>This register is used to configure thr_h_lim value for unit5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U5</name>
              <description>This register is used to confiugre thr_l_lim value for unit5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U6_CONF0</name>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U6</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U6</name>
              <description>This is the enable bit for filtering input signals for unit6.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U6</name>
              <description>This is the enable bit for comparing unit6's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U6</name>
              <description>This is the enable bit for  comparing unit6's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U6</name>
              <description>This is the enable bit for comparing unit6's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U6</name>
              <description>This is the enable bit for comparing unit6's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U6</name>
              <description>This is the enable bit for  comparing  unit6's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U6</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit6. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U6</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit6. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U6</name>
              <description>This register is used to control the mode of channel0's high control signal for unit6. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U6</name>
              <description>This register is used to control the mode of channel0's low control signal for unit6. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U6</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit6. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U6</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit6. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U6</name>
              <description>This register is used to control the mode of channel1's high control signal for unit6. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U6</name>
              <description>This register is used to control the mode of channel1's low control signal for unit6. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U6_CONF1</name>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U6</name>
              <description>This register is used to configure thres0 value for unit6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U6</name>
              <description>This register is used to configure  thres1 value for unit6.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U6_CONF2</name>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U6</name>
              <description>This register is used to configure thr_h_lim value for unit6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U6</name>
              <description>This register is used to confiugre thr_l_lim value for unit6.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U7_CONF0</name>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003C10</resetValue>
          <fields>
            <field>
              <name>FILTER_THRES_U7</name>
              <description>This register is used to filter pluse whose width is smaller than this value for unit7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_EN_U7</name>
              <description>This is the enable bit for filtering input signals for unit7.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_ZERO_EN_U7</name>
              <description>This is the enable bit for comparing unit7's count with 0 value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_H_LIM_EN_U7</name>
              <description>This is the enable bit for  comparing unit7's count with thr_h_lim value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_L_LIM_EN_U7</name>
              <description>This is the enable bit for comparing unit7's count with thr_l_lim  value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES0_EN_U7</name>
              <description>This is the enable bit for comparing unit7's count with  thres0 value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THR_THRES1_EN_U7</name>
              <description>This is the enable bit for  comparing  unit7's count with thres1 value .</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_NEG_MODE_U7</name>
              <description>This register is used to control the mode of channel0's input negedge signal for unit7. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_POS_MODE_U7</name>
              <description>This register is used to control the mode of channel0's input posedge signal for unit7. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_HCTRL_MODE_U7</name>
              <description>This register is used to control the mode of channel0's high control signal for unit7. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_LCTRL_MODE_U7</name>
              <description>This register is used to control the mode of channel0's low control signal for unit7. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_NEG_MODE_U7</name>
              <description>This register is used to control the mode of channel1's input negedge signal for unit7. 2'd1: increase at the negedge of input signal    2'd2:decrease at the negedge of input signal    others:forbidden</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POS_MODE_U7</name>
              <description>This register is used to control the mode of channel1's input posedge signal for unit7. 2'd1: increase at the posedge of input signal    2'd2:decrease at the posedge of input signal    others:forbidden</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_HCTRL_MODE_U7</name>
              <description>This register is used to control the mode of channel1's high control signal for unit7. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_LCTRL_MODE_U7</name>
              <description>This register is used to control the mode of channel1's low control signal for unit7. 2'd0:increase when control signal is low   2'd1: decrease when control signal is high   others:forbidden</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U7_CONF1</name>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_THRES0_U7</name>
              <description>This register is used to configure thres0 value for unit7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_THRES1_U7</name>
              <description>This register is used to configure  thres1 value for unit7.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U7_CONF2</name>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT_H_LIM_U7</name>
              <description>This register is used to configure thr_h_lim value for unit7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_L_LIM_U7</name>
              <description>This register is used to confiugre thr_l_lim value for unit7.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U0_CNT</name>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLUS_CNT_U0</name>
              <description>This register stores the current pulse count value for unit0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>U1_CNT</name>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLUS_CNT_U1</name>
              <description>This register stores the current pulse count value for unit1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
