espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>INT_CLR</name>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s_TX_END_INT_CLR</name>
              <description>Set this bit to clear the rmt_ch%s_rx_end_int_raw..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>8</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s_RX_END_INT_CLR</name>
              <description>Set this bit to clear the rmt_ch%s_tx_end_int_raw.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>8</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s_ERR_INT_CLR</name>
              <description>Set this bit to clear the  rmt_ch%s_err_int_raw.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>8</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>CH%s_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear the  rmt_ch%s_tx_thr_event_int_raw interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CARRIER_DUTY</name>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CARRIER_DUTY</name>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2CARRIER_DUTY</name>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3CARRIER_DUTY</name>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4CARRIER_DUTY</name>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel4.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5CARRIER_DUTY</name>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6CARRIER_DUTY</name>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel6.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel6.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7CARRIER_DUTY</name>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave's low level value for channel7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave's high level value for channel7.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH%s_TX_LIM</name>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>TX_LIM</name>
              <description>When channel0 sends more than reg_rmt_tx_lim_ch0 datas then channel0 produce the relative interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_CONF</name>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_FIFO_MASK</name>
              <description>Set this bit to disable apb fifo access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_TX_WRAP_EN</name>
              <description>when datas need to be send is more than channel's mem can store  then set this bit to enable reusage of mem this bit is used together with reg_rmt_tx_lim_chn.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x16022600</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>This is the version register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
