espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>CLK_CONF</name>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002210</resetValue>
          <fields>
            <field>
              <name>CK8M_DIV</name>
              <description>CK8M_D256_OUT divider. 00: div128  01: div256  10: div512  11: div1024.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CK8M_DIV</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>DIV128</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>DIV256</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>DIV512</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>DIV1024</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB_CK8M</name>
              <description>disable CK8M and CK8M_D256_OUT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENB_CK8M_DIV</name>
              <description>1: CK8M_D256_OUT is actually CK8M  0: CK8M_D256_OUT is CK8M divided by 256</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ENB_CK8M_DIV</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CK8M_DIV_256</name>
                  <description>CK8M_DIV_256</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK8M</name>
                  <description>CK8M</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIG_XTAL32K_EN</name>
              <description>enable CK_XTAL_32K for digital core (no relationship with RTC core)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_CLK8M_D256_EN</name>
              <description>enable CK8M_D256_OUT for digital core (no relationship with RTC core)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_CLK8M_EN</name>
              <description>enable CK8M for digital core (no relationship with RTC core)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_DFREQ_FORCE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_DIV_SEL</name>
              <description>divider = reg_ck8m_div_sel + 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_FORCE_NOGATING</name>
              <description>XTAL force no gating during sleep</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_FORCE_NOGATING</name>
              <description>CK8M force no gating during sleep</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_DFREQ</name>
              <description>CK8M_DFREQ</description>
              <bitOffset>17</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_FORCE_PD</name>
              <description>CK8M force power down</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK8M_FORCE_PU</name>
              <description>CK8M force power up</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC_CLK_SEL</name>
              <description>SOC clock sel. 0: XTAL  1: PLL  2: CK8M  3: APLL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SOC_CLK_SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>XTAL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>PLL</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK8M</name>
                  <description>CK8M</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APLL</name>
                  <description>APLL</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_CLK_RTC_SEL</name>
              <description>fast_clk_rtc sel. 0: XTAL div 4  1: CK8M</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FAST_CLK_RTC_SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>XTAL_DIV_4</name>
                  <description>XTAL_DIV_4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK8M</name>
                  <description>CK8M</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANA_CLK_RTC_SEL</name>
              <description>slow_clk_rtc sel. 0: SLOW_CK  1: CK_XTAL_32K  2: CK8M_D256_OUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ANA_CLK_RTC_SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>SLOW_CK</name>
                  <description>SLOW_CK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK_XTAL_32K</name>
                  <description>CK_XTAL_32K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CK8M_D256_OUT</name>
                  <description>CK8M_D256_OUT</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_CONF</name>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x02A00000</resetValue>
          <fields>
            <field>
              <name>SDIO_PD_EN</name>
              <description>power down SDIO_REG in sleep. Only active when reg_sdio_force = 0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_FORCE</name>
              <description>1: use SW option to control SDIO_REG  0: use state machine</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_TIEH</name>
              <description>SW option for SDIO_TIEH. Only active when reg_sdio_force = 1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG1P8_READY</name>
              <description>read only register for REG1P8_READY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DREFL_SDIO</name>
              <description>SW option for DREFL_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREFM_SDIO</name>
              <description>SW option for DREFM_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREFH_SDIO</name>
              <description>SW option for DREFH_SDIO. Only active when reg_sdio_force = 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SDIO</name>
              <description>SW option for XPD_SDIO_REG. Only active when reg_sdio_force = 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIAS_CONF</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBG_ATTEN</name>
              <description>DBG_ATTEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENB_SCK_XTAL</name>
              <description>ENB_SCK_XTAL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_HEARTBEAT_REFRESH</name>
              <description>INC_HEARTBEAT_REFRESH</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC_HEARTBEAT_PERIOD</name>
              <description>DEC_HEARTBEAT_PERIOD</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_HEARTBEAT_PERIOD</name>
              <description>INC_HEARTBEAT_PERIOD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC_HEARTBEAT_WIDTH</name>
              <description>DEC_HEARTBEAT_WIDTH</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_BIAS_I2C</name>
              <description>RST_BIAS_I2C</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG</name>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x29002400</resetValue>
          <fields>
            <field>
              <name>SCK_DCAP_FORCE</name>
              <description>N/A</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_DBIAS_SLP</name>
              <description>DIG_REG_DBIAS during sleep</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_DBIAS_WAK</name>
              <description>DIG_REG_DBIAS during wakeup</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCK_DCAP</name>
              <description>SCK_DCAP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_SLP</name>
              <description>RTC_DBIAS during sleep</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_WAK</name>
              <description>RTC_DBIAS during wakeup</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOOST_FORCE_PD</name>
              <description>RTC_DBOOST force power down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOOST_FORCE_PU</name>
              <description>RTC_DBOOST force power up</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PD</name>
              <description>RTC_REG force power down (for RTC_REG power down means decrease the voltage to 0.8v or lower )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PU</name>
              <description>RTC_REG force power up</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWC</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00012925</resetValue>
          <fields>
            <field>
              <name>FASTMEM_FORCE_NOISO</name>
              <description>Fast RTC memory force no ISO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_ISO</name>
              <description>Fast RTC memory force ISO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_NOISO</name>
              <description>RTC memory force no ISO</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_ISO</name>
              <description>RTC memory force ISO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ISO</name>
              <description>rtc_peri force ISO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_NOISO</name>
              <description>rtc_peri force no ISO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FOLW_CPU</name>
              <description>1: Fast RTC memory PD following CPU  0: fast RTC memory PD following RTC state machine</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_LPD</name>
              <description>Fast RTC memory force PD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_LPU</name>
              <description>Fast RTC memory force no PD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FOLW_CPU</name>
              <description>1: RTC memory  PD following CPU  0: RTC memory PD following RTC state machine</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_LPD</name>
              <description>RTC memory force PD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_LPU</name>
              <description>RTC memory force no PD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_PD</name>
              <description>Fast RTC memory force power down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_FORCE_PU</name>
              <description>Fast RTC memory force power up</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMEM_PD_EN</name>
              <description>enable power down fast RTC memory in sleep</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_PD</name>
              <description>RTC memory force power down</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_FORCE_PU</name>
              <description>RTC memory force power up</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOWMEM_PD_EN</name>
              <description>enable power down RTC memory in sleep</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PD</name>
              <description>rtc_peri force power down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PU</name>
              <description>rtc_peri force power up</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_EN</name>
              <description>enable power down rtc_peri in sleep</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
