espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>CLK_EDGE_SEL</name>
          <description>SDIO control register.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <resetValue>0x00820200</resetValue>
          <fields>
            <field>
              <name>CCLKIN_EDGE_DRV_SEL</name>
              <description>It's used to select the clock phase of the output signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLKIN_EDGE_SAM_SEL</name>
              <description>It's used to select the clock phase of the input signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLKIN_EDGE_SLF_SEL</name>
              <description>It's used to select the clock phase of the internal signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_H</name>
              <description>The high level of the divider clock. The value should be smaller than CCLKIN_EDGE_L.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_L</name>
              <description>The low level of the divider clock. The value should be  larger than CCLKIN_EDGE_H.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_N</name>
              <description>The value should be equal to CCLKIN_EDGE_L.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESDIO_MODE</name>
              <description>Enable esdio mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESD_MODE</name>
              <description>Enable esd mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLK_EN</name>
              <description>Sdio clock enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SENS</name>
      <description>Peripheral SENS</description>
      <groupName>SENS</groupName>
      <baseAddress>0x3FF48800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SAR_READ_CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00070902</resetValue>
          <fields>
            <field>
              <name>SAR1_CLK_DIV</name>
              <description>clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_SAMPLE_CYCLE</name>
              <description>sample cycles for SAR ADC1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_SAMPLE_BIT</name>
              <description>00: for 9-bit width  01: for 10-bit width  10: for 11-bit width  11: for 12-bit width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_CLK_GATED</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_SAMPLE_NUM</name>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_DIG_FORCE</name>
              <description>1: SAR ADC1 controlled by DIG ADC1 CTRL  0: SAR ADC1 controlled by RTC ADC1 CTRL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_DATA_INV</name>
              <description>Invert SAR ADC1 data</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READ_STATUS1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR1_READER_STATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS_WAIT1</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x000A000A</resetValue>
          <fields>
            <field>
              <name>SAR_AMP_WAIT1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS_WAIT2</name>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0020000A</resetValue>
          <fields>
            <field>
              <name>FORCE_XPD_SAR_SW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XPD_AMP</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XPD_SAR</name>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_RSTB_WAIT</name>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS_CTRL</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x0707338F</resetValue>
          <fields>
            <field>
              <name>XPD_SAR_AMP_FSM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_RST_FB_FSM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_FSM</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_GND_FSM</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_FSM</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RSTB_FSM</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_XPD_WAIT</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READ_STATUS2</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR2_READER_STATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_SLEEP_CYC0</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000C8</resetValue>
          <fields>
            <field>
              <name>SLEEP_CYCLES_S0</name>
              <description>sleep cycles for ULP-coprocessor timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_SLEEP_CYC1</name>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>SLEEP_CYCLES_S1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_SLEEP_CYC2</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000032</resetValue>
          <fields>
            <field>
              <name>SLEEP_CYCLES_S2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_SLEEP_CYC3</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>SLEEP_CYCLES_S3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_SLEEP_CYC4</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>SLEEP_CYCLES_S4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_START_FORCE</name>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>SAR1_BIT_WIDTH</name>
              <description>00: 9 bit  01: 10 bits  10: 11bits  11: 12bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_BIT_WIDTH</name>
              <description>00: 9 bit  01: 10 bits  10: 11bits  11: 12bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_TEST</name>
              <description>SAR2_EN_TEST  only active when reg_sar2_dig_force = 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PWDET_CCT</name>
              <description>SAR2_PWDET_CCT  PA power detector capacitance tuning.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_FORCE_START_TOP</name>
              <description>1: ULP-coprocessor is started by SW  0: ULP-coprocessor is started by timer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_START_TOP</name>
              <description>Write 1 to start ULP-coprocessor  only active when reg_ulp_cp_force_start_top = 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARCLK_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC_INIT</name>
              <description>initialized PC for ULP-coprocessor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_STOP</name>
              <description>stop SAR ADC2 conversion</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_STOP</name>
              <description>stop SAR ADC1 conversion</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PWDET_EN</name>
              <description>N/A</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEM_WR_CTRL</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00100200</resetValue>
          <fields>
            <field>
              <name>MEM_WR_ADDR_INIT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_WR_ADDR_SIZE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_MEM_WR_OFFST_CLR</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_ATTEN1</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SAR1_ATTEN</name>
              <description>2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_ATTEN2</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SAR2_ATTEN</name>
              <description>2-bit attenuation for each pad  11:1dB  10:6dB  01:3dB  00:0dB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR1</name>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS_STATUS</name>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR2</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR2</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR3</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR5</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR4</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_OUT</name>
              <description>temperature sensor data out</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSENS_RDY_OUT</name>
              <description>indicate temperature sensor out ready</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR4</name>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR7</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR6</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_RDATA</name>
              <description>I2C read data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C_DONE</name>
              <description>indicate I2C done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TSENS_CTRL</name>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00066002</resetValue>
          <fields>
            <field>
              <name>TSENS_XPD_WAIT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_XPD_FORCE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_INV</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_GATED</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_IN_INV</name>
              <description>invert temperature sensor data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_DIV</name>
              <description>temperature sensor clock divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_POWER_UP</name>
              <description>temperature sensor power up</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_POWER_UP_FORCE</name>
              <description>1: dump out &amp; power up controlled by SW  0: by FSM</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_DUMP_OUT</name>
              <description>temperature sensor dump out  only active when reg_tsens_power_up_force = 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
