espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>SAR_I2C_CTRL</name>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_CTRL</name>
              <description>I2C control data  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START</name>
              <description>start I2C  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START_FORCE</name>
              <description>1: I2C started by SW  0: I2C started by FSM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS_START1</name>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEAS1_DATA_SAR</name>
              <description>SAR ADC1 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS1_DONE_SAR</name>
              <description>SAR ADC1 conversion done indication</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS1_START_SAR</name>
              <description>SAR ADC1 controller (in RTC) starts conversion  only active when reg_meas1_start_force = 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS1_START_FORCE</name>
              <description>1: SAR ADC1 controller (in RTC) is started by SW  0: SAR ADC1 controller is started by ULP-coprocessor</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_EN_PAD</name>
              <description>SAR ADC1 pad enable bitmap  only active when reg_sar1_en_pad_force = 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_EN_PAD_FORCE</name>
              <description>1: SAR ADC1 pad enable bitmap is controlled by SW  0: SAR ADC1 pad enable bitmap is controlled by ULP-coprocessor</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CTRL1</name>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x02041000</resetValue>
          <fields>
            <field>
              <name>TOUCH_MEAS_DELAY</name>
              <description>the meas length (in 8MHz)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_XPD_WAIT</name>
              <description>the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_SEL</name>
              <description>1: when the counter is greater then the threshold  the touch pad is considered as "touched"  0: when the counter is less than the threshold  the touch pad is considered as "touched"</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_1EN</name>
              <description>1: wakeup interrupt is generated if SET1 is "touched"  0: wakeup interrupt is generated only if SET1 &amp; SET2 is both "touched"</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_HALL_FORCE</name>
              <description>1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALL_PHASE_FORCE</name>
              <description>1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES1</name>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH1</name>
              <description>the threshold for touch pad 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_TH0</name>
              <description>the threshold for touch pad 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES2</name>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH3</name>
              <description>the threshold for touch pad 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_TH2</name>
              <description>the threshold for touch pad 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES3</name>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH5</name>
              <description>the threshold for touch pad 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_TH4</name>
              <description>the threshold for touch pad 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES4</name>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH7</name>
              <description>the threshold for touch pad 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_TH6</name>
              <description>the threshold for touch pad 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_THRES5</name>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_OUT_TH9</name>
              <description>the threshold for touch pad 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_OUT_TH8</name>
              <description>the threshold for touch pad 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_OUT1</name>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_MEAS_OUT1</name>
              <description>the counter for touch pad 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_OUT0</name>
              <description>the counter for touch pad 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_OUT2</name>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_MEAS_OUT3</name>
              <description>the counter for touch pad 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_OUT2</name>
              <description>the counter for touch pad 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_OUT3</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_MEAS_OUT5</name>
              <description>the counter for touch pad 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_OUT4</name>
              <description>the counter for touch pad 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_OUT4</name>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_MEAS_OUT7</name>
              <description>the counter for touch pad 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_OUT6</name>
              <description>the counter for touch pad 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_OUT5</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_MEAS_OUT9</name>
              <description>the counter for touch pad 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_OUT8</name>
              <description>the counter for touch pad 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_CTRL2</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400800</resetValue>
          <fields>
            <field>
              <name>TOUCH_MEAS_EN</name>
              <description>10-bit register to indicate which pads are "touched"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_MEAS_DONE</name>
              <description>fsm set 1 to indicate touch touch meas is done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUCH_START_FSM_EN</name>
              <description>1: TOUCH_START &amp; TOUCH_XPD is controlled by touch fsm  0: TOUCH_START &amp; TOUCH_XPD is controlled by registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_START_EN</name>
              <description>1: start touch fsm  valid when reg_touch_start_force is set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_START_FORCE</name>
              <description>1: to start touch fsm by SW  0: to start touch fsm by timer</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_SLEEP_CYCLES</name>
              <description>sleep cycles for timer</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_MEAS_EN_CLR</name>
              <description>to clear reg_touch_meas_en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_ENABLE</name>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x3FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TOUCH_PAD_WORKEN</name>
              <description>Bitmap defining the working set during the measurement.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_PAD_OUTEN2</name>
              <description>Bitmap defining SET2 for generating wakeup interrupt. SET2 is "touched" only if at least one of touch pad in SET2 is "touched".</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_PAD_OUTEN1</name>
              <description>Bitmap defining SET1 for generating wakeup interrupt. SET1 is "touched" only if at least one of touch pad in SET1 is "touched".</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READ_CTRL2</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00070902</resetValue>
          <fields>
            <field>
              <name>SAR2_CLK_DIV</name>
              <description>clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_SAMPLE_CYCLE</name>
              <description>sample cycles for SAR ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_SAMPLE_BIT</name>
              <description>00: for 9-bit width  01: for 10-bit width  10: for 11-bit width  11: for 12-bit width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_CLK_GATED</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_SAMPLE_NUM</name>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PWDET_FORCE</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_DIG_FORCE</name>
              <description>1: SAR ADC2 controlled by DIG ADC2 CTRL or PWDET CTRL  0: SAR ADC2 controlled by RTC ADC2 CTRL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_DATA_INV</name>
              <description>Invert SAR ADC2 data</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS_START2</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEAS2_DATA_SAR</name>
              <description>SAR ADC2 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS2_DONE_SAR</name>
              <description>SAR ADC2 conversion done indication</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS2_START_SAR</name>
              <description>SAR ADC2 controller (in RTC) starts conversion  only active when reg_meas2_start_force = 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS2_START_FORCE</name>
              <description>1: SAR ADC2 controller (in RTC) is started by SW  0: SAR ADC2 controller is started by ULP-coprocessor</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_PAD</name>
              <description>SAR ADC2 pad enable bitmap  only active when reg_sar2_en_pad_force = 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_PAD_FORCE</name>
              <description>1: SAR ADC2 pad enable bitmap is controlled by SW  0: SAR ADC2 pad enable bitmap is controlled by ULP-coprocessor</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_DAC_CTRL1</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SW_FSTEP</name>
              <description>frequency step for CW generator  can be used to adjust the frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TONE_EN</name>
              <description>1: enable CW generator  0: disable CW generator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_BIT_SEL</name>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_DIG_FORCE</name>
              <description>1: DAC1 &amp; DAC2 use DMA  0: DAC1 &amp; DAC2 do not use DMA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_FORCE_LOW</name>
              <description>1: force PDAC_CLK to low</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_FORCE_HIGH</name>
              <description>1: force PDAC_CLK to high</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_INV</name>
              <description>1: invert PDAC_CLK</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
