espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>OUTLINK_DSCR_BF0</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUTLINK_DSCR_BF0</name>
              <description>The content of next out descriptor pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTLINK_DSCR_BF1</name>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUTLINK_DSCR_BF1</name>
              <description>The content of current out descriptor data buffer pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RSTATUS</name>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUT_STATUS</name>
              <description>spi dma read data from memory status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TSTATUS</name>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_IN_STATUS</name>
              <description>spi dma write data to memory status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01604270</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>SPI register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI1</name>
      <description>SPI (Serial Peripheral Interface) Controller</description>
      <baseAddress>0x3FF42000</baseAddress>
      <interrupt>
        <name>SPI1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>SPI1_DMA</name>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI2</name>
      <description>SPI (Serial Peripheral Interface) Controller</description>
      <baseAddress>0x3FF64000</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>SPI2_DMA</name>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI3</name>
      <description>SPI (Serial Peripheral Interface) Controller</description>
      <baseAddress>0x3FF65000</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>SPI3_DMA</name>
        <value>54</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TIMG0</name>
      <description>Timer Group</description>
      <groupName>TIMG</groupName>
      <baseAddress>0x3FF5F000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TG0_T0_LEVEL</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TG0_T1_LEVEL</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TG0_WDT_LEVEL</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TG0_LACT_LEVEL</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>TG0_T0_EDGE</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TG0_T1_EDGE</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>TG0_WDT_EDGE</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>TG0_LACT_EDGE</name>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>T0CONFIG</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x60002000</resetValue>
          <fields>
            <field>
              <name>ALARM_EN</name>
              <description>When set  alarm is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL_INT_EN</name>
              <description>When set  level type interrupt will be generated during alarm</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_INT_EN</name>
              <description>When set  edge type interrupt will be generated during alarm</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER</name>
              <description>Timer 0 clock (T0_clk) prescale value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORELOAD</name>
              <description>When set  timer 0 auto-reload at alarming is enabled</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCREASE</name>
              <description>When set  timer 0 time-base counter increment. When cleared timer 0 time-base counter decrement.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>When set  timer 0 time-base counter is enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0LO</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>Register to store timer 0 time-base counter current value lower 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0HI</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HI</name>
              <description>Register to store timer 0 time-base counter current value higher 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0UPDATE</name>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UPDATE</name>
              <description>Write any value will trigger a timer 0 time-base counter value update (timer 0 current value will be stored in registers above)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0ALARMLO</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALARM_LO</name>
              <description>Timer 0 time-base counter value lower 32 bits that will trigger the alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0ALARMHI</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALARM_HI</name>
              <description>Timer 0 time-base counter value higher 32 bits that will trigger the alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0LOADLO</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD_LO</name>
              <description>Lower 32 bits of the value that will load into timer 0 time-base counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0LOADHI</name>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD_HI</name>
              <description>higher 32 bits of the value that will load into timer 0 time-base counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0LOAD</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Write any value will trigger timer 0 time-base counter reload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONFIG</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x60002000</resetValue>
          <fields>
            <field>
              <name>ALARM_EN</name>
              <description>When set  alarm is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL_INT_EN</name>
              <description>When set  level type interrupt will be generated during alarm</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_INT_EN</name>
              <description>When set  edge type interrupt will be generated during alarm</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER</name>
              <description>Timer 1 clock (T1_clk) prescale value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORELOAD</name>
              <description>When set  timer 1 auto-reload at alarming is enabled</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCREASE</name>
              <description>When set  timer 1 time-base counter increment. When cleared timer 1 time-base counter decrement.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>When set  timer 1 time-base counter is enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1LO</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>Register to store timer 1 time-base counter current value lower 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1HI</name>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HI</name>
              <description>Register to store timer 1 time-base counter current value higher 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1UPDATE</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UPDATE</name>
              <description>Write any value will trigger a timer 1 time-base counter value update (timer 1 current value will be stored in registers above)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1ALARMLO</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALARM_LO</name>
              <description>Timer 1 time-base counter value lower 32 bits that will trigger the alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1ALARMHI</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALARM_HI</name>
              <description>Timer 1 time-base counter value higher 32 bits that will trigger the alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1LOADLO</name>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD_LO</name>
              <description>Lower 32 bits of the value that will load into timer 1 time-base counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1LOADHI</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD_HI</name>
              <description>higher 32 bits of the value that will load into timer 1 time-base counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1LOAD</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Write any value will trigger timer 1 time-base counter reload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
