espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>WDTCONFIG0</name>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x0004C000</resetValue>
          <fields>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>When set  flash boot protection is enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>length of system reset selection. 0: 100ns  1: 200ns  2: 300ns  3: 400ns  4: 500ns  5: 800ns  6: 1.6us  7: 3.2us</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WDT_SYS_RESET_LENGTH</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NS100</name>
                  <description>100ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS200</name>
                  <description>200ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS300</name>
                  <description>300ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS400</name>
                  <description>400ns</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS500</name>
                  <description>500ns</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS800</name>
                  <description>800ns</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS1600</name>
                  <description>1.6us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS3200</name>
                  <description>3.2us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>length of CPU reset selection. 0: 100ns  1: 200ns  2: 300ns 3: 400ns  4: 500ns  5: 800ns  6: 1.6us  7: 3.2us</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WDT_CPU_RESET_LENGTH</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NS100</name>
                  <description>100ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS200</name>
                  <description>200ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS300</name>
                  <description>300ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS400</name>
                  <description>400ns</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS500</name>
                  <description>500ns</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS800</name>
                  <description>800ns</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS1600</name>
                  <description>1.6us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS3200</name>
                  <description>3.2us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_LEVEL_INT_EN</name>
              <description>When set  level type interrupt generation is enabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EDGE_INT_EN</name>
              <description>When set  edge type interrupt generation is enabled</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>Stage 3 configuration. 0: off  1: interrupt  2: reset CPU  3: reset system</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WDT_STG3</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset CPU</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_SYS</name>
                  <description>Reset system</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>Stage 2 configuration. 0: off  1: interrupt  2: reset CPU  3: reset system</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WDT_STG3"/>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>Stage 1 configuration. 0: off  1: interrupt  2: reset CPU  3: reset system</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WDT_STG3"/>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>Stage 0 configuration. 0: off  1: interrupt  2: reset CPU  3: reset system</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WDT_STG3"/>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>When set  SWDT is enabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG1</name>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>WDT_CLK_PRESCALE</name>
              <description>SWDT clock prescale value. Period = 12.5ns * value stored in this register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG2</name>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x018CBA80</resetValue>
          <fields>
            <field>
              <name>WDT_STG0_HOLD</name>
              <description>Stage 0 timeout value in SWDT clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG3</name>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x07FFFFFF</resetValue>
          <fields>
            <field>
              <name>WDT_STG1_HOLD</name>
              <description>Stage 1 timeout value in SWDT clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG4</name>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FFFFF</resetValue>
          <fields>
            <field>
              <name>WDT_STG2_HOLD</name>
              <description>Stage 2 timeout value in SWDT clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG5</name>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FFFFF</resetValue>
          <fields>
            <field>
              <name>WDT_STG3_HOLD</name>
              <description>Stage 3 timeout value in SWDT clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTFEED</name>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WDT_FEED</name>
              <description>Write any value will feed SWDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTWPROTECT</name>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x50D83AA1</resetValue>
          <fields>
            <field>
              <name>WDT_WKEY</name>
              <description>If change its value from default  then write protection is on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG</name>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00013000</resetValue>
          <fields>
            <field>
              <name>RTC_CALI_START_CYCLING</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_CLK_SEL</name>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_RDY</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_MAX</name>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_START</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG1</name>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTC_CALI_VALUE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTCONFIG</name>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x60002300</resetValue>
          <fields>
            <field>
              <name>LACT_RTC_ONLY</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_CPST_EN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_LAC_EN</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_ALARM_EN</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_LEVEL_INT_EN</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_EDGE_INT_EN</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_DIVIDER</name>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_AUTORELOAD</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_INCREASE</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_EN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTRTC</name>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_RTC_STEP_LEN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTLO</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTHI</name>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_HI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTUPDATE</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_UPDATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTALARMLO</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_ALARM_LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTALARMHI</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_ALARM_HI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTLOADLO</name>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_LOAD_LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTLOADHI</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_LOAD_HI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LACTLOAD</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LACT_LOAD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_TIMERS</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0_INT_ENA</name>
              <description>interrupt when timer0 alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T1_INT_ENA</name>
              <description>interrupt when timer1 alarm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_INT_ENA</name>
              <description>Interrupt when an interrupt stage timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACT_INT_ENA</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW_TIMERS</name>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0_INT_RAW</name>
              <description>interrupt when timer0 alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>T1_INT_RAW</name>
              <description>interrupt when timer1 alarm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT_RAW</name>
              <description>Interrupt when an interrupt stage timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LACT_INT_RAW</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST_TIMERS</name>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0_INT_ST</name>
              <description>interrupt when timer0 alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>T1_INT_ST</name>
              <description>interrupt when timer1 alarm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT_ST</name>
              <description>Interrupt when an interrupt stage timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LACT_INT_ST</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR_TIMERS</name>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0_INT_CLR</name>
              <description>interrupt when timer0 alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>T1_INT_CLR</name>
              <description>interrupt when timer1 alarm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_INT_CLR</name>
              <description>Interrupt when an interrupt stage timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LACT_INT_CLR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
