espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>MEM_CONF</name>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000088</resetValue>
          <fields>
            <field>
              <name>MEM_PD</name>
              <description>Set this bit to power down mem.when reg_mem_pd registers in the 3 uarts are all set to 1  mem will enter low power mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SIZE</name>
              <description>This register is used to configure the amount of mem allocated to receiver's fifo. the default byte num is 128.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SIZE</name>
              <description>This register is used to configure the amount of mem allocated to transmitter's fifo.the default byte num is 128.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FLOW_THRHD_H3</name>
              <description>refer to the rx_flow_thrhd's describtion.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TOUT_THRHD_H3</name>
              <description>refer to the rx_tout_thrhd's describtion.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XON_THRESHOLD_H2</name>
              <description>refer to the uart_xon_threshold's describtion.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XOFF_THRESHOLD_H2</name>
              <description>refer to the uart_xoff_threshold's describtion.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MEM_FULL_THRHD</name>
              <description>refer to the rxfifo_full_thrhd's describtion.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MEM_EMPTY_THRHD</name>
              <description>refer to txfifo_empty_thrhd 's describtion.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_TX_STATUS</name>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_TX_STATUS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_RX_STATUS</name>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_RX_STATUS</name>
              <description>This register stores the current uart rx mem read address  and rx mem write address </description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_RX_RD_ADDR</name>
              <description>This register stores the rx mem read address </description>
              <bitOffset>2</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_RX_WR_ADDR</name>
              <description>This register stores the rx mem write address </description>
              <bitOffset>13</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CNT_STATUS</name>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_MEM_CNT</name>
              <description>refer to the rxfifo_cnt's describtion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_MEM_CNT</name>
              <description>refer to the txfifo_cnt's describtion.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POSPULSE</name>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FFFFF</resetValue>
          <fields>
            <field>
              <name>POSEDGE_MIN_CNT</name>
              <description>This register stores the count of rxd posedge edge. it is used in boudrate-detect process.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NEGPULSE</name>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000FFFFF</resetValue>
          <fields>
            <field>
              <name>NEGEDGE_MIN_CNT</name>
              <description>This register stores the count of rxd negedge edge. it is used in boudrate-detect process.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x15122500</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID</name>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000500</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
