espressif/arduino-esp32/tools/ide-debug/svd/esp32.svd
        <register>
          <name>HUNG_CONF</name>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00810810</resetValue>
          <fields>
            <field>
              <name>TXFIFO_TIMEOUT</name>
              <description>This register stores the timeout value.when DMA takes more time than this register value to receive a data  it will produce  uhci_tx_hung_int interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_SHIFT</name>
              <description>The tick count is cleared when its value >=(17'd8000>>reg_txfifo_timeout_shift)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_ENA</name>
              <description>The enable bit for txfifo receive data  timeout</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT</name>
              <description>This register stores the timeout value.when DMA takes more time than this register value to read a data from RAM  it will produce  uhci_rx_hung_int interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_SHIFT</name>
              <description>The tick count is cleared when its value >=(17'd8000>>reg_rxfifo_timeout_shift)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_ENA</name>
              <description>This is the enable bit for DMA  send data timeout</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACK_NUM</name>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RX_HEAD</name>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_HEAD</name>
              <description>This register stores the packet header received by DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUICK_SENT</name>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SINGLE_SEND_NUM</name>
              <description>The bits are used to choose which short packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLE_SEND_EN</name>
              <description>Set this bit to enable  send a short packet</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_NUM</name>
              <description>The bits are used to choose which short packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_EN</name>
              <description>Set this bit to enable continuously send the same short packet</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q0_WORD0</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q0_WORD1</name>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q1_WORD0</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q1_WORD1</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q2_WORD0</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q2_WORD1</name>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q3_WORD0</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q3_WORD1</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q4_WORD0</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q4_WORD1</name>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q5_WORD0</name>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q5_WORD1</name>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q6_WORD0</name>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD0</name>
              <description>This register stores the content of short packet's first dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Q6_WORD1</name>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD1</name>
              <description>This register stores the content of short packet's second dword</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF0</name>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DCDBC0</resetValue>
          <fields>
            <field>
              <name>SEPER_CHAR</name>
              <description>This register stores the seperator char  seperator char is used to seperate the data frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR0</name>
              <description>This register stores thee first char used to replace seperator char in data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR1</name>
              <description>This register stores the second char used to replace seperator char in data . 0xdc 0xdb replace 0xc0 by default.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF1</name>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DDDBDB</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ0</name>
              <description>This register stores the first substitute char used to replace the seperator char.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR0</name>
              <description>This register stores the first char used to replace reg_esc_seq0 in data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR1</name>
              <description>This register stores the second char used to replace the reg_esc_seq0 in data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF2</name>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DEDB11</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ1</name>
              <description>This register stores the flow control char to turn on the flow_control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR0</name>
              <description>This register stores the first char used to replace the reg_esc_seq1 in data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR1</name>
              <description>This register stores the second char used to replace the reg_esc_seq1 in data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF3</name>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DFDB13</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ2</name>
              <description>This register stores the flow_control char to turn off the flow_control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR0</name>
              <description>This register stores the first char used to replace the reg_esc_seq2 in data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR1</name>
              <description>This register stores  the second char used to replace the reg_esc_seq2 in data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_THRES</name>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>PKT_THRS</name>
              <description>when the amount of packet payload is greater than this value the process of receiving data is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x16041001</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UHCI0">
      <name>UHCI1</name>
      <description>Universal Host Controller Interface</description>
      <baseAddress>0x3FF4C000</baseAddress>
      <interrupt>
        <name>UHCI1</name>
        <value>13</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>